src/01_software/00_misc/01_logs/misc_1_logs.org
#+TITLE: Misc 1 Logs

#+BEGIN_EXPORT html
<pre>
<code>> ./blog-1/01_software/00_misc/01_logs/misc_1_logs.html</code>
</pre>
#+END_EXPORT

@@html:<p><a href="https://hnvy.github.io/blog-1/">Home page</a></p>@@

@@html:<p><a href="https://github.com/hnvy/blog-1/edit/main/src/01_software/00_misc/01_logs/misc_1_logs.org">ESotP</a></p>@@

@@html:<hr>@@

* Introduction
:PROPERTIES:
:CUSTOM_ID: intro
:END:
See [[https://hnvy.github.io/html/about.html#misc][this]].

* E#002 (25/07/2022) - CMD, find X in subdirectories.
:PROPERTIES:
:CUSTOM_ID: orgb2a8f30
:END:
Let's imagine that you are searching through a number of files for the string "~please find me~". There are 400 text files in 20 directories. You're unsure of which file that string belongs in.

What's the solution? Well, ~findstr~!

~findstr~ is a command that runs on CMD. Using ~findstr~ is very simple (you can run ~findstr /?~ to get the manual). My favourite arguments to run are:
- ~/s~: searches the subdirectories
- ~/i~: ignores sentence-case
- ~/c:~: allows ~findstr~ to search for a string that has white spaces

Suppose you have the following directory ~c:/Stats/Spreadsheets/~. Also, let's assume that the ~Spreadsheets~ folder has many files and many subfolders, and you're looking for the "~please find me~" string:
- ~findstr /s /i /c:"please find me" "c:/Stats/Spreadsheets/*"~ - This can be used if you aren't currently located in the directory.
- ~findstr /s /i /c:"please find me" *.*~ - this can be used if you are located in the directory.

* E#001 (16/07/2022) - RegEx, match lines to end of file.
:PROPERTIES:
:CUSTOM_ID: org317807a
:END:
In a text file, I recently had to replace something. Starting at a certain text (~PieceOfText~), up until the last line of the file. Here is how I went about it:
#+BEGIN_SRC
Find: PieceOfText((.|\n)*)
Replace: Blah blah blah
#+END_SRC

So, with the help of ~((.|\n)*)~, the following has been highlighted:

#+BEGIN_EXPORT html
<code>
<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.</p>
<p>Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.</p>
<div style="background-color: yellow;"><p>PieceOfText</p>
<p>Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>
<p>Here is the end of the text file. Nice!</p></div>
</code>
#+END_EXPORT
